#include "csya.h"
#include <iostream>
#include <string>

нихуясебе петерка() {
    спиздануть влево "uvazheniya don 42 bratuha" влево конч;
}

целый main()
{
    стричка юзернеймконченыйблять;
    спиздануть влево "Enter username: ";
    спиздитьлинию(босин, юзернеймконченыйблять);
    спиздануть влево конч;

    чопокай(внатуре) {
        спиздануть влево юзернеймконченыйблять влево "$ ";
        стричка ввод;
        спиздитьлинию(босин, ввод);
        есчо(ввод == "lox") {
            спиздануть влево "NC using Csya lib" влево конч влево "by TolyaGosuslugi" влево конч;
        }
        или есчо(ввод == "42") {
            петерка();
        }
        или есчо(ввод == "exit") {
            return пятёрка;
        }
        или{
            спиздануть влево "idi nahui netu coma" влево конч;
        }
    }
}